{"name":"Heroes of the Storm - Hero Best Talent Build","count":273,"frequency":"Weekly","version":4,"newdata":true,"lastrunstatus":"success","thisversionstatus":"success","nextrun":"Sat Aug 22 2015 14:34:50 GMT+0000 (UTC)","thisversionrun":"Sat Aug 15 2015 14:34:50 GMT+0000 (UTC)","results":{"talents":[{"name":"Reanimation: Every Regeneration Globe gathered increases your Health Regeneration by 1.5 per second, even during Undying.  You also gain the ability to gather Regeneration Globes while Undying.","index":1,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Leoric"},{"name":"Fealty Unto Death: When a nearby Minion dies, you gain 1% of your maximum Health and 5 Mana, even while Undying.","index":2,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Leoric"},{"name":"Ossein Renewal: Activate to heal 20% of your maximum life over 6 seconds. Can be used while Undying to revive faster.","index":3,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Leoric"},{"name":"March of the Black King: Become Unstoppable and swing your mace three times, healing yourself for 7.03% of your maximum Health for each enemy Hero hit and dealing 200 (+10 per level) damage.","index":4,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Leoric"},{"name":"Burning Rage: Deal 10 damage per second to nearby enemies.","index":5,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Leoric"},{"name":"Consume Vitality: Skeletal Swing heals you for 2% of your maximum Health per target hit, up to 10%. Effective while Undying.","index":6,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Leoric"},{"name":"Spectral Leech: Basic Attacks against enemy Heroes deal bonus damage equal to 5% of the Hero's maximum Health and heal you for the same amount.","index":7,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Leoric"},{"name":"Death Ritual: Permanently gain 5 Health and 3 Mana when a Minion dies under Voodoo Ritual.","index":8,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Nazeebo"},{"name":"Spider Cluster: Corpse Spiders creates 3 more spiders over 3 seconds.","index":9,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Nazeebo"},{"name":"Gidbinn: Increases the explosion area of Plague Toads and the duration of your Zombie Wall and Corpse Spiders by 25%.","index":10,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Nazeebo"},{"name":"Gargantuan: Summon a Gargantuan that guards you for 20 seconds. Deals 30 (+15 per level) damage to nearby enemies when summoned, attacks for 100 (+20 per level) damage, and can be ordered to stomp, dealing 30 (+15 per level) damage. The Gargantuan deals extra damage to Minions and Structures.","index":11,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Nazeebo"},{"name":"Sprint: Activate to gain 75% Movement Speed for 3 seconds.","index":12,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Nazeebo"},{"name":"Leaping Spiders: Corpse Spiders leap at their targets and deal 25% more damage.","index":13,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Nazeebo"},{"name":"Fury of the Storm: Every 5 seconds, your next basic attack will deal an additional 20 damage to the target, and 20 damage to all nearby Minions and Mercenaries.","index":14,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Nazeebo"},{"name":"Deep Chill: Increases the slow of Chill from 25% to 35%.","index":15,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Jaina"},{"name":"Snowstorm: Increases the radius of Blizzard by 30%.","index":16,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Jaina"},{"name":"Frostbitten: Increases the damage bonus of Frostbite from 50% to 65%.","index":17,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Jaina"},{"name":"Summon Water Elemental: Summons a Water Elemental at target location, dealing 65 (+7 per level) damage and Chilling nearby enemies. The Water Elemental's Basic Attacks do 50 (+6 per level) damage, splash for 25% damage and Chill. Can reactivate the Ability to retarget the Water Elemental.  Lasts 20 seconds.","index":18,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Jaina"},{"name":"Improved Ice Block: Activate to place yourself in Stasis and gain Invulnerability for 3 seconds. When this effect expires, nearby enemies are Chilled.","index":19,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Jaina"},{"name":"Northern Exposure: Enemies damaged by Cone of Cold are also afflicted with Vulnerable, increasing the damage they take by 25% for 2 seconds.","index":20,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Jaina"},{"name":"Bolt of the Storm: Activate to teleport to a nearby location.","index":21,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Jaina"},{"name":"Viking Bribery: Kill enemy Minions to gain stacks of Bribe.  Use 40 stacks to bribe target Mercenary, instantly defeating them.  Does not work on Bosses.  Maximum stacks available: 100.","index":22,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=The%20Lost%20Vikings"},{"name":"Erik the Swift: Permanently increases Erik's base Movement Speed by 10%, and as long as Erik is moving he heals 15 (+3 per level) Health per second.","index":23,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=The%20Lost%20Vikings"},{"name":"Spin To Win!: Activate to have each Viking deal 42 (+9 per level) damage to nearby enemies.","index":24,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=The%20Lost%20Vikings"},{"name":"Play Again!: Summon, fully heal, and revive all Lost Vikings at target location after a Viking channels for 2 seconds. \nOnly one Viking may attempt to summon at a time.","index":25,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=The%20Lost%20Vikings"},{"name":"Jump!: Makes all Vikings Invulnerable and able to pass over enemies for 1.5 seconds.","index":26,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=The%20Lost%20Vikings"},{"name":"Large and In Charge: When Olaf charges enemies, they are stunned for 1 second.","index":27,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=The%20Lost%20Vikings"},{"name":"Fury of the Storm: Every 5 seconds, your next Basic Attack will deal an additional 10 (+4 per level) damage to the target, and 10 (+11 per level) damage to all nearby Minions and Mercenaries.  Each Viking has their own cooldown.","index":28,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=The%20Lost%20Vikings"},{"name":"Block: Periodically reduces the damage received from Hero Basic Attacks by 50%.  Stores up to 2 charges.","index":29,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Murky"},{"name":"Living The Dream: Passively grants 5% Ability Power. Every 5 seconds Murky is alive he gains 1% more Ability Power, to a maximum of 15% extra. These stacks are lost on death.","index":30,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Murky"},{"name":"Slime Advantage: Your Basic Attacks deal 100% bonus damage to Slimed targets.","index":31,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Murky"},{"name":"Octo-Grab: Summon an octopus to stun target enemy Hero for 3.0625 seconds while you hit them for 1 damage a second.","index":32,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Murky"},{"name":"Wrath of Cod: Increase Pufferfish's damage by 35% against Slimed targets.","index":33,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Murky"},{"name":"Slimy Pufferfish: The Pufferfish casts Slime at its location upon landing.","index":34,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Murky"},{"name":"... And A Shark Too!: Increases the damage of Octo-Grab by 10000% (+1000% per level).","index":35,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Murky"},{"name":"Knight Takes Pawn: Condemn deals 80 (+20 per level) additional damage to Minions and Mercenaries and stuns them for 4 seconds.","index":36,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Johanna"},{"name":"Laws of Hope: Regenerate 1 Health per second.\nActivate to heal 20% of your max Health over 4 seconds.","index":37,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Johanna"},{"name":"Conviction: Condemn increases your Movement Speed by 25% for 1 second.","index":38,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Johanna"},{"name":"Blessed Shield: Deal 70 (+9 per level) damage and stun the first enemy hit for 2 seconds. Blessed Shield then bounces to 2 nearby enemies, dealing 35 (+4.5 per level) damage and stunning them for 1 second.","index":39,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Johanna"},{"name":"Burning Rage: Deal 10 damage per second to nearby enemies.","index":40,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Johanna"},{"name":"Blessed Hammer: Condemn also creates a hammer that spirals around you, dealing 40 (+2.5 per level) damage to enemies it hits.","index":41,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Johanna"},{"name":"Indestructible: Upon taking fatal damage, gain a Shield equal to your maximum Health for 5 seconds. This ability has a 120 second cooldown.","index":42,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Johanna"},{"name":"Reconstitution: Health Restoration bonus on Creep increased by 200%.","index":43,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Zagara"},{"name":"Envenomed Spines: Basic Attacks have their range increased by 20% and deal an additional 15 (+3 per level) damage over 3 seconds.","index":44,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Zagara"},{"name":"Battle Momentum: Basic Attacks reduce Ability cooldowns by 0.5 seconds.","index":45,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Zagara"},{"name":"Devouring Maw: Summons a Devouring Maw that deals 75 (+24 per level) damage and devours enemies for 4 seconds. Devoured enemies cannot fight and take 38 (+2 per level) damage per second.","index":46,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Zagara"},{"name":"Mutalisk: Your Hunter Killer now spawns a Mutalisk with a bounce attack and 50% increased duration.","index":47,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Zagara"},{"name":"Brood Expansion: Can hold up to 2 charges of Hunter Killer.","index":48,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Zagara"},{"name":"Bolt of the Storm: Activate to teleport to a nearby location.","index":49,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Zagara"},{"name":"Timeless Creature: Increases the duration of Cloud Serpent by 50%.","index":50,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Li%20Li"},{"name":"Mending Serpent: Cloud Serpent heals the friendly unit for 15 (+1.65 per level) Health each time it attacks.","index":51,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Li%20Li"},{"name":"Lightning Serpent: Cloud Serpent's attacks bounce to 3 nearby enemy targets, dealing 10 (+1.1 per level) damage each.","index":52,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Li%20Li"},{"name":"Jug of 1,000 Cups: Rapidly tosses brew to the most injured nearby allies, prioritizing Heroes, restoring a total of 480 (+156 per level) Health over 6 seconds.","index":53,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Li%20Li"},{"name":"Hindering Winds: Blinding Wind also slows enemy Movement Speed by 25% for 2 seconds.","index":54,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Li%20Li"},{"name":"Serpent Sidekick: You also gain a Cloud Serpent whenever you cast it on another ally.","index":55,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Li%20Li"},{"name":"Kung Fu Hustle: Abilities recharge two and a half times as fast while Fast Feet is active.","index":56,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Li%20Li"},{"name":"Conjurer's Pursuit: Collecting Regeneration Globes permanently increases Mana Regeneration by 0.1015 per second.","index":57,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Uther"},{"name":"Protective Shield: Activate to shield an allied Hero for 15% of their max Health for 5 seconds.","index":58,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Uther"},{"name":"Cleanse: Activate to remove all stuns, roots, silences, and slows from the target and prevents their reapplication for 1 second.","index":59,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Uther"},{"name":"Divine Shield: Make an allied Hero Invulnerable and increase their Movement Speed by 20% for 3 seconds.","index":60,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Uther"},{"name":"Shrink Ray: Activate to reduce an enemy Hero's damage by 50% and Movement Speed by 50% for 4 seconds.","index":61,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Uther"},{"name":"Benediction: Activate to reduce the Mana cost of your next Basic Ability by 50 and its cooldown by 10 seconds.","index":62,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Uther"},{"name":"Storm Shield: Activate to give all nearby allied Heroes a Shield for 20% of their max Health for 3 seconds.","index":63,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Uther"},{"name":"Regeneration Master: Collecting Regeneration Globes permanently increases Health Regeneration by 1.5 per second.","index":64,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Zeratul"},{"name":"Focused Attack: Every 10 seconds, your next Basic Attack deals 75% additional damage.  Basic Attacks reduce this cooldown by 1 second.","index":65,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Zeratul"},{"name":"Follow Through: After using an ability, your next Basic Attack within 6 seconds deals 40% additional damage.","index":66,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Zeratul"},{"name":"Void Prison: Slows time in an area to a near standstill, making allies and enemies invulnerable and unable to act for 5 seconds. You are not affected.","index":67,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Zeratul"},{"name":"Wormhole: For 3 seconds, you can activate Blink again to return to the point where it was cast from.","index":68,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Zeratul"},{"name":"Rending Cleave: Cleave deals an additional 50% damage over 5 seconds.","index":69,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Zeratul"},{"name":"Nexus Blades: Basic attacks deal 20% more damage and slow the target for 1 second.","index":70,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Zeratul"},{"name":"Mana Addict: Increase your maximum Mana by 15 when you pick up a Regeneration Globe.","index":71,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Kael'thas"},{"name":"Gathering Power: Passively grants 5% Ability Power. Each Hero takedown increases this bonus by 2% to a maximum of 15%. This bonus Ability Power is reset to 5% on death.","index":72,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Kael'thas"},{"name":"Fission Bomb: Increases Living Bomb's explosion damage by 75%.","index":73,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Kael'thas"}
,{"name":"Phoenix: Launch a Phoenix to an area, dealing 10 (+8 per level) damage to enemies along the way. The Phoenix persists for 7 seconds, attacking enemies for 10 (+8 per level) damage and splashing for 50%.","index":74,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Kael'thas"},{"name":"Chain Bomb: Living Bomb's explosion applies Living Bomb to enemies not already affected by it.","index":75,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Kael'thas"},{"name":"Ignite: Flamestrike also applies Living Bomb to Heroes not already affected by it.","index":76,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Kael'thas"},{"name":"Rebirth: Increases Phoenix duration by 100%. You may order the Phoenix to move to a different location once while the Phoenix is alive.","index":77,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Kael'thas"},{"name":"Victuals: Heal for 3% of your Maximum Health when you collect Fresh Meat. Meat continues to drop at maximum stacks.","index":78,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=The%20Butcher"},{"name":"Cheap Shot: Hamstring does 100% more damage to targets affected by a slow, root, or stun.","index":79,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=The%20Butcher"},{"name":"Abattoir: Increases the maximum number of Fresh Meat to 35, and you only lose half upon death.","index":80,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=The%20Butcher"},{"name":"Lamb to the Slaughter: Throw a hitching post that attaches to the nearest enemy Hero after a 1 second delay.  This deals 75 (+15 per level) damage and causes the enemy to be chained to the post for 4 seconds.","index":81,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=The%20Butcher"},{"name":"Crave Flesh: While an enemy is affected by Butcher's Brand, you gain 30% Movement Speed.","index":82,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=The%20Butcher"},{"name":"Blood Frenzy: Fresh Meat also increases your Attack Speed by 1% per stack.","index":83,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=The%20Butcher"},{"name":"Nexus Blades: Basic attacks deal 20% more damage and slow the target for 1 second.","index":84,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=The%20Butcher"},{"name":"Taste for Blood: Enemies killed by Globe of Annihilation's impact permanently increase its damage by 2 up to a maximum of 500.","index":85,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Azmodan"},{"name":"Bound Minion: Using General of Hell on a Lane Minion decreases the non-Heroic damage they take by -24% and increases the damage they deal to non-Heroic targets by 100%. Lasts 30 seconds.","index":86,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Azmodan"},{"name":"Infernal Globe: Reduces the cast and travel time by 40% and deals an additional 12 (+3 per level) damage over 4 seconds.","index":87,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Azmodan"},{"name":"Black Pool: Create a pool that empowers Azmodan, his Demons, and allied Minions, increasing their attack and ability damage by 75%. Pools last 5 seconds.","index":88,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Azmodan"},{"name":"March of Sin: Azmodan can move at 75% speed while channeling All Shall Burn.","index":89,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Azmodan"},{"name":"Blood for Blood: Activate to deal 10% of target enemy Hero's Max Health and heal for twice that amount.","index":90,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Azmodan"},{"name":"Fifth Circle: Azmodan and other empowered ally attacks and Abilities slow Movement and Attack Speeds by 40% for 3 seconds.","index":91,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Azmodan"},{"name":"Moonburn: Increases Moonfire's damage to Minions and Mercenaries by 100%.","index":92,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Malfurion"},{"name":"Elune's Grace: Increases the range of Regrowth, Moonfire, and Entangling Roots by 30%.","index":93,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Malfurion"},{"name":"Enduring Growth: Increases the duration of Regrowth by 6 seconds.","index":94,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Malfurion"},{"name":"Tranquility: Heals 20 (+9 per level) Health per second to nearby allies over 10 seconds.","index":95,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Malfurion"},{"name":"Life Seed: Nearby damaged allied Heroes will automatically gain the heal over time portion of Regrowth. This effect has a 20 second cooldown.","index":96,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Malfurion"},{"name":"Tenacious Roots: Entangling Roots grows 25% larger, lasts 25% longer, and roots targets for 0.5 seconds longer.","index":97,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Malfurion"},{"name":"Storm Shield: Activate to give all nearby allied Heroes a Shield for 20% of their max Health for 3 seconds.","index":98,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Malfurion"},{"name":"Regeneration Master: Collecting Regeneration Globes permanently increases Health Regeneration by 1.5 per second.","index":99,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Anub'arak"},{"name":"Legion of Beetles: Anub'arak automatically spawns Beetles every 8 seconds.  Can be toggled on and off.","index":100,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Anub'arak"},{"name":"Leeching Scarabs: Beetles heal Anub'arak for 50% of their damage with each attack if he is nearby.","index":101,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Anub'arak"},{"name":"Locust Swarm: Duration: 8 seconds\nDeal 16 (+6.4 per level) damage per second in an area around Anub'arak. Each enemy damaged heals Anub'arak for 10 (+1.5 per level) health.","index":102,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Anub'arak"},{"name":"Burning Rage: Deal 10 damage per second to nearby enemies.","index":103,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Anub'arak"},{"name":"Imposing Presence: Enemies that attack you have their Attack Speed slowed by 50%.","index":104,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Anub'arak"},{"name":"Hive Master: Anub'arak gains a permanent Vampire Locust that attacks a nearby enemy every 3 seconds. The Vampire Locust deals 16 (+16 per level) damage and returns to heal Anub'arak for 20 (+3 per level) health.","index":105,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Anub'arak"},{"name":"Purge Evil: Smite deals 25% more damage to Heroes.","index":106,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tyrael"},{"name":"Amplified Healing: Increases regeneration effects and all healing received by 30%.","index":107,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tyrael"},{"name":"Battle Momentum: Basic Attacks reduce Ability cooldowns by 0.5 seconds.","index":108,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tyrael"},{"name":"Judgment: Charge target enemy Hero, dealing 60 (+8 per level) damage and stunning them for 1.5 seconds. While charging, nearby enemies are knocked back and take 30 (+4 per level) damage.","index":109,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tyrael"},{"name":"Burning Rage: Deal 10 damage per second to nearby enemies.","index":110,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tyrael"},{"name":"Blood for Blood: Activate to deal 10% of target enemy Hero's Max Health and heal for twice that amount.","index":111,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tyrael"},{"name":"Nexus Blades: Basic attacks deal 20% more damage and slow the target for 1 second.","index":112,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tyrael"},{"name":"Rabid Wolves: Damaging Heroes with Feral Spirit grants 3 stacks of Frostwolf Resilience.","index":113,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Thrall"},{"name":"Envenom: Activate to poison an enemy Hero, dealing 179.96 damage over 10 seconds.","index":114,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Thrall"},{"name":"Wind Shear: Reduces the cooldown of Windfury by 4 seconds.","index":115,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Thrall"},{"name":"Sundering: After a short delay, sunder the earth in a long line. Deals 160 (+22 per level) damage and shoves enemies to the side, stunning them for 1.5 seconds.","index":116,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Thrall"},{"name":"Grace Of Air: Windfury attacks grant twice as many stacks of Frostwolf Resilience.","index":117,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Thrall"},{"name":"Tempest Fury: The final strike of Windfury hits 3 times for 75% normal damage.","index":118,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Thrall"},{"name":"Nexus Blades: Basic attacks deal 20% more damage and slow the target for 1 second.","index":119,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Thrall"},{"name":"Scrap-o-Matic Smelter: Increases the amount of Mana restored by scrap to 60.","index":120,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Gazlowe"},{"name":"Reduce, Reuse, Recycle: Enemy minions that die near you have a 15% chance to drop scrap.","index":121,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Gazlowe"},{"name":"Rock-It! Turret XL: Turrets attack up to 2 additonal targets for 50% damage.","index":122,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Gazlowe"},{"name":"Grav-o-bomb 3000: After a 2 second delay, pull enemies toward the center of an area and deal 150 (+20 per level) damage.","index":123,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Gazlowe"},{"name":"Turret Storage: Max Turret charges increased to 3.","index":124,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Gazlowe"},{"name":"Long-Ranged Turrets: Turret range increased by 40%.","index":125,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Gazlowe"},{"name":"Miniature Black Hole: Grav-O-Bomb radius increased by 25% and damage increased by 50%.","index":126,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Gazlowe"},{"name":"Barbed Shot: Withering Fire deals 200% bonus damage to Minions and Mercenaries.","index":127,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sylvanas"},{"name":"Envenom: Activate to poison an enemy Hero, dealing 179.96 damage over 10 seconds.","index":128,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sylvanas"},{"name":"Unstable Poison: Minions and Mercenaries that die under the effects of Black Arrows explode, dealing 75 (+9 per level) damage to nearby enemies.","index":129,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sylvanas"},{"name":"Wailing Arrow: Shoot an arrow that can be reactivated to deal 140 (+18 per level) damage and Silencing enemies in an area making them unable to use Abilities for 2.5 seconds. The arrow detonates automatically when it reaches maximum range.","index":130,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sylvanas"}
,{"name":"Splinter Shot: Withering Fire hits a second target for 18.75 (+2.25 per level) damage.","index":131,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sylvanas"},{"name":"Cold Embrace: Shadow Dagger makes enemies Vulnerable, taking 25% more damage, but the range of Shadow Dagger is reduced by 25%.","index":132,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sylvanas"},{"name":"Deafening Blast: Enemies at the center of Wailing Arrow's explosion take 50% more damage and are silenced for twice as long.","index":133,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sylvanas"},{"name":"Seasoned Marksman: For every 6 enemy Minion or Mercenary kills near your Hero, gain 1 Basic Attack damage. Hero Takedowns count as 2 Minion kills.","index":134,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Raynor"},{"name":"Focused Attack: Every 10 seconds, your next Basic Attack deals 75% additional damage.  Basic Attacks reduce this cooldown by 1 second.","index":135,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Raynor"},{"name":"Revolution Overdrive: Gain 10% Movement Speed while affected by Inspire.  Increase this bonus by 5% for each allied Hero nearby when Inspire is cast.","index":136,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Raynor"},{"name":"Hyperion: Order the Hyperion to make a strafing run dealing 25 (+6 per level) damage a second, hitting up to 4 enemies. Also occasionally fires its Yamato Cannon on Structures for 300 (+72 per level) damage. Lasts 12 seconds.","index":137,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Raynor"},{"name":"Giant Killer: Basic Attacks against enemy Heroes deal bonus damage equal to 1.5% of the Hero's maximum Health.","index":138,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Raynor"},{"name":"Bullseye: The first enemy hit by Penetrating Round is stunned for 1 second and takes 50% more damage.","index":139,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Raynor"},{"name":"Nexus Frenzy: Increases Attack Speed by 20% and Attack Range by 20%.","index":140,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Raynor"},{"name":"Ambush Snipe: Increases Snipe's damage by 20% when used from Cloak or within one second of being Cloaked.","index":141,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Nova"},{"name":"Gathering Power: Passively grants 5% Ability Power. Each Hero takedown increases this bonus by 2% to a maximum of 15%. This bonus Ability Power is reset to 5% on death.","index":142,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Nova"},{"name":"Anti-Armor Shells: Your Basic Attacks deal 250% damage, but your Attack Speed is proportionally slower.","index":143,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Nova"},{"name":"Precision Strike: After a 1.5 second delay, deals 300 (+35 per level) damage in an area. Unlimited range.","index":144,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Nova"},{"name":"Lethal Decoy: Holo Decoy now deals 25% of Nova's damage.","index":145,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Nova"},{"name":"Double Fake: Casting Holo Decoy creates an additional Decoy at your current location.","index":146,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Nova"},{"name":"Rewind: Activate to reset the cooldowns of your Basic Abilities.","index":147,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Nova"},{"name":"Spiritwalker's Grace: Reduces Chain Heal's Mana cost from 70 to 45.","index":148,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Rehgar"},{"name":"Feral Heart: Increases Health and Mana Regeneration by 75% while in Ghost Wolf form.","index":149,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Rehgar"},{"name":"Earth Shield: Lightning Shield also gives the ally a Shield that absorbs 75 damage over 3 seconds.","index":150,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Rehgar"},{"name":"Ancestral Healing: After a short delay, heals target allied Hero for 600 (+140 per level).","index":151,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Rehgar"},{"name":"Healing Surge: Increases Chain Heal's healing on the primary target by 25% and heal an additional target.","index":152,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Rehgar"},{"name":"Lightning Bond: Casting Lightning Shield on an ally also casts it on you, including any talent bonuses.","index":153,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Rehgar"},{"name":"Storm Shield: Activate to give all nearby allied Heroes a Shield for 20% of their max Health for 3 seconds.","index":154,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Rehgar"},{"name":"Armor Piercing Rounds: Overkill's damage to the primary target increased by 20%.","index":155,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tychus"},{"name":"Spray 'n' Pray: Overkill's range increased by 15%.","index":156,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tychus"},{"name":"First Aid: Activate to heal 11.07% of your max Health over 6 seconds.","index":157,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tychus"},{"name":"Drakken Laser Drill: Call down a Laser Drill to attack nearby enemies, dealing 30 (+14 per level) damage every second. Reactivate to assign a new target. Lasts 22 seconds.","index":158,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tychus"},{"name":"Lead Rain: Overkill applies a stacking slow, up to 20%.","index":159,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tychus"},{"name":"Lock and Load: While the Minigun is wound up, gain 15% increased Move Speed.","index":160,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tychus"},{"name":"Focusing Diodes: Increases the range of the Drakken Laser Drill by 50%.  Deals increased damage the longer it remains on a single target, up to 100% extra damage.","index":161,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tychus"},{"name":"Ranger's Mark: Lower the Cooldown of Hunter's Mark by 8 seconds.","index":162,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tyrande"},{"name":"Protective Shield: Activate to shield an allied Hero for 15% of their max Health for 5 seconds.","index":163,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tyrande"},{"name":"Lunar Blaze: Increases the range of Lunar Flare by 50%.","index":164,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tyrande"},{"name":"Starfall: Deal 20 (+6 per level) damage per second and slow enemies by 20% in an area. Lasts 8 seconds.","index":165,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tyrande"},{"name":"Sprint: Activate to gain 75% Movement Speed for 3 seconds.","index":166,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tyrande"},{"name":"Shooting Star: Lunar Flare deals 50% more damage and refunds all Mana if you hit an enemy Hero.","index":167,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tyrande"},{"name":"Rewind: Activate to reset the cooldowns of your Basic Abilities.","index":168,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tyrande"},{"name":"Siphoning Arrow: 50% of the damage dealt by Hungering Arrow is returned as Health to Valla.","index":169,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Valla"},{"name":"Puncturing Arrow: Hungering Arrow range increased by 25% and the number of times it can bounce to 3.","index":170,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Valla"},{"name":"Repeating Arrow: The cooldown for Hungering Arrow is reset when Vault is used.","index":171,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Valla"},{"name":"Strafe: Rapidly attack nearby visible enemies for 15 (+6.75 per level) damage per hit, prioritizing heroes over minions. Valla is able to move and use Vault while strafing. Lasts for 4 seconds.","index":172,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Valla"},{"name":"Frost Shot: Multishot also slows by 40% for 2 seconds.","index":173,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Valla"},{"name":"Blood for Blood: Activate to deal 10% of target enemy Hero's Max Health and heal for twice that amount.","index":174,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Valla"},{"name":"Bolt of the Storm: Activate to teleport to a nearby location.","index":175,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Valla"},{"name":"Power Throw: Increase the range of Hammerang by 40% and the slow duration by 25%.","index":176,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Falstad"},{"name":"Gathering Power: Passively grants 5% Ability Power. Each Hero takedown increases this bonus by 2% to a maximum of 15%. This bonus Ability Power is reset to 5% on death.","index":177,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Falstad"},{"name":"Secret Weapon: Basic Attacks deal 80% bonus damage while Hammerang is in flight.","index":178,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Falstad"},{"name":"Hinterland Blast: After a short delay, deal 280 (+31 per level) damage to enemies within a long line.","index":179,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Falstad"},{"name":"Thunderstrikes: Lightning Rod deals 15% more damage each subsequent strike.","index":180,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Falstad"},{"name":"Hammer Time: Your first Basic Attack against a target slowed by Hammerang will stun them for 0.75 seconds.","index":181,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Falstad"},{"name":"Nexus Frenzy: Increases Attack Speed by 20% and Attack Range by 20%.","index":182,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Falstad"},{"name":"Reverberation: Enemies hit by Thunder Clap have their Attack Speed reduced by 50% for 3 seconds.","index":183,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Muradin"},{"name":"Thunderburn: Thunder Clap leaves a zone on the ground that explodes after 2 seconds dealing 25 (+4 per level) damage and applying a 25% slow for 2.5 seconds.","index":184,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Muradin"},{"name":"Piercing Bolt: Penetrates through the first target hit, hitting 1 additional target.","index":185,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Muradin"},{"name":"Avatar: Transform for 20 seconds, gaining 320 Health and causing your Basic Attacks to stun enemies.","index":186,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Muradin"},{"name":"Burning Rage: Deal 10 damage per second to nearby enemies.","index":187,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Muradin"},{"name":"Stoneform: Activate to heal for 50% of your maximum Health over 8 seconds. Second Wind is disabled during this time.","index":188,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Muradin"},{"name":"Unstoppable Force: Increases the duration of Avatar by 30%, and the duration of Disables are reduced by 75% while in Avatar.","index":189,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Muradin"},{"name":"Regeneration Master: Collecting Regeneration Globes permanently increases Health Regeneration by 1.5 per second.","index":190,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Arthas"},{"name":"Destruction: Damage boost of Frostmourne Hungers increased to 150% damage.","index":191,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Arthas"},{"name":"Rune Tap: Every 3rd Basic Attack heals you for 3.12% of your max Health.","index":192,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Arthas"},{"name":"Summon Sindragosa: Deals 150 (+15 per level) damage, slows enemy Heroes, and freezes Minions for 10 seconds and Structures for 20 seconds.","index":193,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Arthas"},{"name":"Biting Cold: Frozen Tempest damage increased by 50%.","index":194,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Arthas"},{"name":"Frostmourne Feeds: Increased application to your next 2 Basic Attacks.","index":195,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Arthas"},{"name":"Absolute Zero: Sindragosa flies twice as far.  Enemy Heroes are rooted for 2 seconds, and then slowed by 60% for 2 seconds.","index":196,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Arthas"},{"name":"Pressurized Glands: Increases the range of Symbiote's Spike Burst by 25% and decreases the cooldown by 1 second.","index":197,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Abathur"},{"name":"Adrenal Overload: Symbiote host gains 25% increased Attack Speed.","index":198,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Abathur"},{"name":"Calldown: MULE: Activate to calldown a Mule that repairs Structures, one at a time, near target point for 40 seconds, healing for 100 Health every 1 second.  Grants 1 ammo every  3 seconds.","index":199,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Abathur"},{"name":"Evolve Monstrosity: Turn an allied Minion or Locust into a Monstrosity. When enemy Minions near the Monstrosity die, it gains 5% Health and 5% Basic Attack damage, stacking up to 30 times.  The Monstrosity takes 50% less damage from Minions and Structures.\nUsing Symbiote on the Monstrosity allows you to control it, in addition to Symbiote's normal benefits.","index":200,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Abathur"},{"name":"Soma Transference: Symbiote's Spike Burst heals the host for 20 (+6 per level) Health per enemy Hero hit.","index":201,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Abathur"},{"name":"Envenomed Spikes: Your Symbiote's Spike Burst also slows enemy Movement Speed by 40% for 2 seconds.","index":202,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Abathur"},{"name":"Hivemind: Casting Symbiote creates an additional Symbiote on a nearby allied Hero.  This Symbiote mimics the commands of the first. If the second host moves too far away, it is destroyed.","index":203,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Abathur"},{"name":"Advanced Artillery: Increase the damage bonus to long distance enemies by 10%.","index":204,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sgt.%20Hammer"},{"name":"Maelstrom Shells: Increase standard Basic Attack range by 20%.","index":205,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sgt.%20Hammer"},{"name":"First Aid: Activate to heal 11.07% of your max Health over 6 seconds.","index":206,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sgt.%20Hammer"},{"name":"Napalm Strike: Deals 40 (+16 per level) damage on impact. Additionally deals 30 (+4 per level) damage per second.  Lasts for 4 seconds.","index":207,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sgt.%20Hammer"},{"name":"Giant Killer: Basic Attacks against enemy Heroes deal bonus damage equal to 1.5% of the Hero's maximum Health.","index":208,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sgt.%20Hammer"},{"name":"Graduating Range: While in Siege Mode your standard Basic Attack range increases by 20% every 3 seconds, up to 100%.","index":209,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sgt.%20Hammer"},{"name":"Advanced Lava Strike: Napalm Strike's range is increased by 75% and its impact does 50% more damage.","index":210,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sgt.%20Hammer"},{"name":"Sweeping Grasp: Increases the range of Primal Grasp by 20%.","index":211,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Kerrigan"},{"name":"Envenom: Activate to poison an enemy Hero, dealing 179.96 damage over 10 seconds.","index":212,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Kerrigan"},{"name":"Impaling Swarm: Impaling Blades spawns 2 Zerglings at the target location.","index":213,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Kerrigan"},{"name":"Summon Ultralisk: Summon an Ultralisk that attacks the target to deal 40 (+8 per level) damage. Attacks splash to nearby enemies for 50% damage. Can reactivate the Ability to retarget the Ultralisk. Lasts for 20 seconds.","index":214,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Kerrigan"},{"name":"Sprint: Activate to gain 75% Movement Speed for 3 seconds.","index":215,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Kerrigan"},{"name":"Blood for Blood: Activate to deal 10% of target enemy Hero's Max Health and heal for twice that amount.","index":216,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Kerrigan"},{"name":"Nexus Blades: Basic attacks deal 20% more damage and slow the target for 1 second.","index":217,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Kerrigan"},{"name":"Shadow Shield: Evasion grants a 62.5 point Shield for 5 seconds.","index":218,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Illidan"},{"name":"Immolation: After using Sweeping Strike, burn nearby enemies for 13 (+2.5 per level) damage a second for 4 seconds.","index":219,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Illidan"},{"name":"First Aid: Activate to heal 11.07% of your max Health over 6 seconds.","index":220,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Illidan"},{"name":"The Hunt: Charge to target unit, dealing 150 (+20 per level) damage on impact and stunning for 1 second.","index":221,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Illidan"},{"name":"Sixth Sense: Take 50% reduced damage from Abilities while Evasion is active.","index":222,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Illidan"},{"name":"Blood for Blood: Activate to deal 10% of target enemy Hero's Max Health and heal for twice that amount.","index":223,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Illidan"},{"name":"Nowhere to Hide: Grants global range.","index":224,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Illidan"},{"name":"Regeneration Master: Collecting Regeneration Globes permanently increases Health Regeneration by 1.5 per second.","index":225,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Chen"},{"name":"Amplified Healing: Increases regeneration effects and all healing received by 30%.","index":226,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Chen"},{"name":"Brewmaster's Balance: While at or below 50 Brew, gain 20% Movement Speed. While at or above 50 Brew, regenerate an additional 10 Health per second.","index":227,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Chen"},{"name":"Storm, Earth, Fire: Split into three elemental spirits for 15.15 seconds, each with 50% of your maximum Health, and enables two new leaping attacks for use.\nStorm attacks at range for 30 damage. \nEarth attacks slowly for 20 damage and slows enemies by 25%. \nFire attacks quickly for 18 damage.","index":228,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Chen"},{"name":"Enough to Share: Fortifying Brew also Shields nearby allied Heroes for 10 per second.","index":229,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Chen"},{"name":"Pressure Point: Flying Kick slows the target enemy by 90% for 1 second.","index":230,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Chen"},{"name":"Elemental Conduit: Using an Ability will cause one of the elemental spirits to fight with you for 4 seconds. Only one spirit can be active at a time.","index":231,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Chen"},{"name":"War Paint: Basic Attacks heal you for 30% of the damage dealt.","index":232,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sonya"},{"name":"Superiority: Reduce damage taken from Minions, Structures, and Mercenaries by 50%.","index":233,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sonya"},{"name":"Poisoned Spear: Ancient Spear deals an additional 75% damage over 4 seconds.","index":234,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sonya"},{"name":"Wrath of the Berserker: Increases damage dealt by 40%. Reduces the duration of silences, stuns, slows, roots, and polymorphs against you by 50%. Lasts 15 seconds, and extends by 1 second for every 10 Fury gained.","index":235,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sonya"},{"name":"Mystical Spear: Reduces the cooldown of Ancient Spear by 4 seconds. You are pulled to the target location even if you don't hit an enemy.","index":236,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sonya"},{"name":"Furious Blow: Increases Seismic Slam damage by 40%, but now costs 35 Fury.","index":237,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sonya"},{"name":"Nexus Blades: Basic attacks deal 20% more damage and slow the target for 1 second.","index":238,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Sonya"},{"name":"Soul Feast: Black Soulstone increases your Health Regeneration by 3% per Soul.","index":239,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Diablo"},{"name":"Fire Devil: Fire Stomp also surrounds you in flames that deal 10 (+2 per level) damage every second for 6 seconds.","index":240,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Diablo"},{"name":"Soul Steal: Increases the amount of Health gained from Black Soulstone by 66%.","index":241,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Diablo"},{"name":"Lightning Breath: Become Unstoppable while channeling lightning that deals 320 (+72 per level) damage over 4 seconds.  The direction of the Lightning changes with your mouse cursor position.","index":242,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Diablo"},{"name":"Firestorm: Fire Stomp waves return to you, dealing 125% damage.","index":243,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Diablo"},{"name":"Imposing Presence: Enemies that attack you have their Attack Speed slowed by 50%.","index":244,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Diablo"},{"name":"Hellstorm: Lightning Breath lasts and reaches 50% longer.","index":245,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Diablo"},{"name":"Hyper Shift: Every time you heal a Hero with Soothing Mist, reduce the cooldown of Phase Shift by 2 seconds.","index":246,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Brightwing"},{"name":"Peekaboo!: Phase Shifting to an ally grants vision and reveals cloakers in a large area for 6 seconds.","index":247,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Brightwing"},{"name":"Phase Shield: After finishing the teleport, the target of your Phase Shift gains a 200 point Shield for 20 seconds.","index":248,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Brightwing"},{"name":"Blink Heal: Teleport to a nearby ally, healing them for 108 (+17 per level).  Can store 2 charges.","index":249,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Brightwing"},{"name":"Shield Dust: Pixie Dust now reduces Ability damage taken by 50%.","index":250,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Brightwing"},{"name":"Critterize: Polymorph causes targets to take 25% more damage.","index":251,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Brightwing"},{"name":"Storm Shield: Activate to give all nearby allied Heroes a Shield for 20% of their max Health for 3 seconds.","index":252,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Brightwing"},{"name":"Pwn Shop Guitar: Reduces Guitar Solo's Mana cost by 40%.","index":253,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=E.T.C."},{"name":"Double-Necked Guitar: Increases Powerslide's width by 100% and you slide 30% faster.","index":254,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=E.T.C."},{"name":"Guitar Hero: While Guitar Solo is active, you heal for 50% of the damage dealt by Basic Attacks.","index":255,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=E.T.C."},{"name":"Mosh Pit: After 0.75 seconds, channel to stun nearby enemies for 4 seconds.","index":256,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=E.T.C."},{"name":"Show Stopper: Reduces all damage taken by 25% for 4 seconds after using Powerslide.","index":257,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=E.T.C."},{"name":"Speed Metal: Rockstar also gives 20% Movement Speed for 2 seconds.","index":258,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=E.T.C."},{"name":"Tour Bus: Mosh Pit refreshes the cooldown of Powerslide. You can Powerslide during Mosh Pit, which also increases its duration by 2 seconds.","index":259,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=E.T.C."},{"name":"Conjurer's Pursuit: Collecting Regeneration Globes permanently increases Mana Regeneration by 0.1015 per second.","index":260,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tassadar"},{"name":"Healing Ward: Activate to place a ward on the ground that heals allies in an area for 1.95% of their max Health every second for 10 seconds.","index":261,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tassadar"},{"name":"Static Charge: Enemies damaged by Psionic Storm are marked with Static Charge. Your Basic Attacks consume the Static Charge to deal 24 (+4.5 per level) damage.","index":262,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tassadar"},{"name":"Archon: Transform into an Archon, gaining a 200 point Shield, causing Basic Attacks to deal 64 (+12 per level) damage and splash for 32 (+6 per level) additional damage. Lasts for 12 seconds.","index":263,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tassadar"},{"name":"Prescience: Dimensional Shift will automatically activate when you fall below 15% Health. This effect has a separate 45 second cooldown.","index":264,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tassadar"},{"name":"Dimensional Warp: While Dimensional Shifted, gain 50% Movement Speed and heal for 40 (+40 per level) Health.","index":265,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tassadar"},{"name":"Twilight Archon: Increases Archon's initial Shield, Attack Damage, and Basic Attack range by 35%.","index":266,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Tassadar"},{"name":"Chew Your Food: Using Devour also heals you for 9.555% of your max Health over 3.0625 seconds.","index":267,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Stitches"},{"name":"Amplified Healing: Increases regeneration effects and all healing received by 30%.","index":268,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Stitches"},{"name":"Tenderizer: Basic Attacks slow enemy Movement Speed by 25% for 1.5 seconds.","index":269,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Stitches"},{"name":"Putrid Bile: Emit bile that deals 20 (+3 per level) damage per second to enemies within, slowing them by 35%. You gain 20% Movement Speed while emitting bile. Lasts 8 seconds.","index":270,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Stitches"},{"name":"Relentless: Reduces the duration of silences, stuns, slows, and roots against your Hero by 50%.","index":271,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Stitches"},{"name":"Fishing Hook: Hook has an additional 40% range.","index":272,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Stitches"},{"name":"Regenerative Bile: Putrid Bile lasts 2 seconds longer, grants an additional 10% Movement Speed and heals for 50% of the damage dealt.","index":273,"url":"https://www.hotslogs.com/Sitewide/HeroDetails?Hero=Stitches"}]}}
